vms/server/plugins/analytics/axis_analytics_plugin/src/gsoap/generated_with_soapcpp2/XML examples/EventBinding.RemoveScheduledEvent.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns6="http://www.w3.org/2005/08/addressing"
    xmlns:ns4="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:ns2="http://docs.oasis-open.org/wsn/t-1"
    xmlns:ns3="http://docs.oasis-open.org/wsn/b-2"
    xmlns:ns1="http://www.axis.com/vapix/ws/event1"
    xmlns:ns5="http://www.axis.com/vapix/ws/action1">
 <SOAP-ENV:Body>
  <!-- __ns1__RemoveScheduledEvent(..., _ns1__RemoveScheduledEvent *ns1__RemoveScheduledEvent, ...) -->
   <!-- _ns1__RemoveScheduledEvent *ns1__RemoveScheduledEvent -->
   <ns1:RemoveScheduledEvent>
    <!-- std::string EventID -->
    <ns1:EventID></ns1:EventID>
   </ns1:RemoveScheduledEvent>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
